pigeon0411/icub-firmware/emBODY/eBcode/arch-dspic/board/2foc/appl/2FOC-V3/src/2FOC.c
volatile int  IKp = 0; //8;
volatile int  IKi = 0; //2;
volatile char IKs = 0; //10;
volatile long IIntLimit = 0;//800L*1024L;

volatile int  SKp = 0x0C;
volatile int  SKi = 0x10;
volatile char SKs = 0x0A;
volatile long SIntLimit = 0;//800L*1024L;

/////////////////////////////////////////

void setMaxCurrent(int nom, int peak, int ovr)
{
    Inom = nom;
    Ipeak = peak;
    I2nom = (long)nom*(long)nom;
    I2Tlimit = ((long)peak*(long)peak - I2nom) * 10;
    Iovr = ovr;
}

void setIPid(int kp, int ki, char shift)
{
    IKp = kp;
    IKi = ki/2;
    IKs = shift;
    IIntLimit = ((long)PWM_MAX)<<shift;
}

void setSPid(int kp, int ki, char shift)
{
    SKp = kp;
    SKi = ki/2;
    SKs = shift;
    SIntLimit = ((long)PWM_MAX)<<shift;
}

void ZeroControlReferences()
{
    CtrlReferences.VqRef = 0;
    CtrlReferences.IqRef = 0;
    CtrlReferences.WRef = 0;

    VdA = 0;
    VqA = 0;
    VqL = 0;
    VqRef = 0;
    IqRef = 0;
    speed_error_old = 0;
    Is = 0;
    iQerror_old = 0;
    iDerror_old = 0;
    limit = 0;
    // TODO: zero position and sensored torque references
}

void RequestControlMode(char cm)
{
    //if (cm == gControlMode) return;

    ZeroControlReferences();

    ++gCtrlModeReqCnt;
    gCtrlModeReq = cm;
}

void ResetSetpointWatchdog()
{
    WriteTimer5(0);
    IFS1bits.T5IF = 0;
}

        ///////////////////////////
        /*
        static int qe_watchdog = 0;
        if (delta)
        {
            QEisOk = 1;
            qe_watchdog = 0;
        }
        else if (!MotorConfig.has_hall)
        {
            if ((I2Tdata.IQMeasured > Ipeak/2) || (I2Tdata.IQMeasured < -Ipeak/2))
            {
                if (++qe_watchdog > 10000)
                {
                    // QE is broken
                    qe_watchdog = 0;
                    gEncoderError.stuck = TRUE;
                    SysError.EncoderFault = TRUE;
                    FaultConditionsHandler();
                }
            }
        }
        */
        ///////////////////////////

BOOL updateOdometry()
{
    if (MotorConfig.has_qe || MotorConfig.has_speed_qe)
    {
        static const int UNDERSAMPLING = PWMFREQUENCY / 1000;
        static int speed_undersampler = 0;

        static int position_old = 0;
        int position = QEgetPos();
        int delta = position - position_old;

        position_old = position;

        if (sAlignInProgress)
        {
            gQEPosition = 0;
            gQEVelocity = 0;
            return FALSE;
        }

        gQEPosition += delta;

        if (++speed_undersampler == UNDERSAMPLING) // we obtain ticks per ms
        {
            speed_undersampler = 0;

            static long QEPosition_old = 0;

            gQEVelocity = (1 + gQEVelocity + gQEPosition - QEPosition_old) / 2;

            QEPosition_old = gQEPosition;

            return TRUE;
        }

        return FALSE;
    }
    else if (MotorConfig.has_hall)
    {
        gQEPosition = DHESPosition();
        gQEVelocity = DHESVelocity();

        return FALSE;
    }

    return FALSE;
}

volatile int dataA = 0;
volatile int dataB = 0;
volatile int dataC = 0;
volatile int dataD = 0;
    
extern volatile BOOL newencdata;

int alignRotor(volatile int* IqRef)
{
    if (MotorConfig.has_hall) return 0;
    
    if (!sAlignInProgress) return 0;

    static int encoder_fake = 0;
    
    static int IqRef_fake = 0;
    
    static BOOL moved = FALSE;
    
    if (abs((int)POSCNT) > 32) moved = TRUE;
    
    const int ENCODER_1_5_REV = (3*QE_ELETTR_DEG_PER_REV())/2;
    
    if (sAlignInProgress < 3)
    {       
        if (QEready())
        {
            if (!moved)
            {
                // phase is broken
                *IqRef = IqRef_fake = 0;
                QE_RISE_ERROR(phase_broken);
                sAlignInProgress = 0;
            }
            
            sAlignInProgress = gEncoderConfig.full_calibration ? 3 : 0;
            gEncoderError.uncalibrated = 0;
            QEcountErrorClear();
        }
    }
    
    static int deltaA =  60;
    static int deltaB = -60;
    
    //static int deltaA = -120;
    //static int deltaB =    0;
    
    if (sAlignInProgress == 1)
    {
        static int timer = 0;
        
        if (IqRef_fake < Inom/2)
        {
            ++IqRef_fake;
        }
        else if (encoder_fake < ENCODER_1_5_REV)
        {
            if (++timer > 200) { timer = 0; ++encoder_fake; }
        }
        else
        {
            deltaA = -120;
            deltaB = 0;
            sAlignInProgress = 2;
        }
    }
    
    if (sAlignInProgress == 2)
    {
        static int timer = 0;
        
        if (encoder_fake > -ENCODER_1_5_REV)
        {
            if (++timer > 200) { timer = 0; --encoder_fake; }
        }
        else
        {
            // Index is broken
            *IqRef = IqRef_fake = 0;
            QE_RISE_ERROR(index_broken);
            sAlignInProgress = 0;
        }
    }
    
    ////////////////////////////////////
    
    static int encoder_fake_0 = 0x7FFF;
    
    if (sAlignInProgress == 3)
    {
        static int timer = 0;
         
        encoder_fake_0 = encoder_fake;
        
        if (IqRef_fake < Inom)
        {
            ++IqRef_fake;
        }
        else if (++timer > 10000)
        {
            sAlignInProgress = 4;
        }
    }
    
    static int rotorA;
    static int rotorB;
    
    static unsigned int timer = 0;
    
    if (sAlignInProgress == 4)
    {
        encoder_fake = encoder_fake_0 + deltaA;
        
        if (++timer > 30000)
        {
            rotorA = __builtin_divsd(__builtin_mulss((int)POSCNT, gEncoderConfig.elettr_deg_per_rev),QE_RESOLUTION);
            
            timer = 0;
            
            sAlignInProgress = 5;
        }
    }
    
    if (sAlignInProgress == 5)
    {
        encoder_fake = encoder_fake_0 + deltaB;
        
        if (++timer > 60000)
        {
            IqRef_fake = 0;
            
            rotorB = __builtin_divsd(__builtin_mulss((int)POSCNT, gEncoderConfig.elettr_deg_per_rev),QE_RESOLUTION);
            
            int delta = rotorB - rotorA;
            
